Repository: dev-khanh/flutter_find_room_demo
Catalog: res/values/strings_*.arb
Languages: vi

# app_title
source: Find room
vi: Phòng trọ tốt

# settings_title
source: Settings
vi: Cài đặt

# saved_rooms_title
source: Saved rooms
vi: Đã lưu

# login_title
source: Login
vi: Đăng nhập

# detail_title
source: Detail
vi: Chi tiết

source: Change language
vi: Thay đổi ngôn ngữ

source: Forgot password?
vi: Bạn quên mật khẩu?

source: Or connect through
vi: hoặc kết nối qua

source: No account?
vi: Chưa có tài khoản?

source: Register now
vi: Đăng kí ngay

source: Password *
vi: Mật khẩu *

source: Exit app
vi: Thoát khỏi ứng dụng

# sure_want_to_exit_app
source: Are you sure you want to exit the application?
vi: Bạn chắc chắn muốn thoát khỏi ứng dụng?

source: No
vi: Không

source: Exit
vi: Thoát

source: Settings
vi: Cài đặt

# see_all_
source: See all: $title
vi: Xem tất cả: $title

source: See all
vi: Xem tất cả

source: Add to saved
vi: Thêm vào đã lưu

source: Remove from saved
vi: Xóa khỏi đã lưu

source: Empty rooms...
vi: Chưa có nhà trọ nào...

source: Login now
vi: Đăng nhập ngay

source: Logout
vi: Đăng xuất

source: Cancel
vi: Hủy

# sure_want_to_logout
source: Are you sure you want to logout?
vi: Bạn chắc chắn muốn đăng xuất?

# home_page_title
source: Home page
vi: Trang chủ

source: Most viewed
vi: Xem nhiều

source: Newest
vi: Mới nhất

# saved_list_empty
source: Saved list is empty
vi: Bạn chưa lưu nhà trọ nào

# change_language_success
source: Change language successfully
vi: Thay đổi ngôn ngữ thành công

# change_language_error
source: Error when chane language: $error
vi: Lỗi khi thay đổi ngôn ngữ: $error

# change_language_failure
source: Error when chane language
vi: Lỗi khi thay đổi ngôn ngữ

# remove_saved_room_success_with_title
source: Remove room '$title' from saved list successfully
vi: Xóa '$title' khỏi danh sách đã lưu thành công

# remove_saved_room_error
source: Error when remove room from saved list
vi: Lỗi khi xóa khỏi danh sách đã lưu

source: Removed
vi: Xóa

# error_occurred
source: An error occurred
vi: Có lỗi xảy ra

# require_login
source: You must be signed in
vi: Bạn cần phải đăng nhập

# change_province_success
source: Change to '$provinceName' successfully
vi: Chuyển sang '$provinceName' thành công

# change_province_error
source: Error when change to '$provinceName'
vi: Lỗi xảy ra khi chuyển sang '$provinceName'

# add_saved_room_success
source: Added to saved list successfully
vi: Thêm vào danh sách đã lưu thành công

# remove_saved_room_success
source: Remove from saved list successfully
vi: Xóa khỏi danh sách đã lưu thành công

# add_or_remove_saved_room_error
source: An error occurred. Try again later
vi: Đã có lỗi xảy ra. Hãy thử lại

# logout_error
source: An error occurred when logout
vi: Lỗi xảy ra khi đăng xuất

# logout_success
source: Logout successfully
vi: Đăng xuất thành công

# login_success
source: Login successfully
vi: Đăng nhập thành công

source: Password at least 6 characters
vi: Mật khẩu ít nhất 6 kí tự

source: Invalid email address
vi: Sai định dạng email

# network_error
source: A network error (such as timeout, interrupted connection or unreachable host) has occurred
vi: Lỗi kết nối mạng

# too_many_requests_error
source: Too many requests
vi: Quá nhiều request

# user_not_found_error
source: There is no user record corresponding to this identifier. The user may have been deleted
vi: Không có người dùng nào tương ứng với số nhận dạng này. Người dùng có thể đã bị xóa

# wrong_password_error
source: The password is invalid or the user does not have a password
vi: Mật khẩu không hợp lệ hoặc người dùng không có mật khẩu

# invalid_email_error
source: The email address is badly formatted
vi: Địa chỉ email bị định dạng sai

# email_already_in_user_error
source: The email address is already in use by another account
vi: Địa chỉ email đã được một tài khoản khác sử dụng

# weak_password_error
source: The given password is invalid
vi: Mật khẩu đã cho không hợp lệ

# user_disabled_error
source: The user account has been disabled by an administrator
vi: Tài khoản người dùng đã bị quản trị viên vô hiệu hóa

# invalid_credential_error
source: Invalid credential
vi: Thông tin đăng nhập không hợp lệ

source: Account exists with difference credential error
vi: Tài khoản tồn tại với khác nhau

# operation_not_allowed_error
source: Operation not allowed
vi: Hoạt động không được cho phép

# google_sign_in_canceled_error
source: Google sign in canceled
vi: Đăng nhập bằng google bị hủy

# facebook_login_cancelled_by_user
source: Facebook sign in canceled by user
vi: Đăng nhập bằng facebook bị hủy bởi người dùng

source: Full name at least 6 characters
vi: Tên ít nhất 6 kí tự

source: Full name
vi: Họ tên

source: Invalid phone number
vi: Sai định dạng SĐT

# empty_address
source: Address must be not empty
vi: Địa chỉ trống

source: Address
vi: Địa chỉ

source: Phone number
vi: SĐT

source: Exit register
vi: Bạn muốn thoát đăng kí

# exit_register_message
source: Processing register...Are you sure you want to exit?
vi: Đang xử lí đăng kí... bạn có chắc chắn muốn thoát?

# register_success
source: Register successfully
vi: Đăng kí thành công

source: Register
vi: Đăng kí

source: Exit login
vi: Bạn muốn thoát đăng nhập

# exit_login_message
source: Processing login...Are you sure you want to exit?
vi: Đang xử lí đăng nhập... bạn có chắc chắn muốn thoát?

source: Send email
vi: Gửi

# forgot_password_title
source: Forgot password
vi: Quên mật khẩu

# exit_send_email
source: Exit reset password
vi: Bạn muốn thoát gửi email reset mật khẩu?

# exit_send_email_message
source: Processing send email...Are you sure you want to exit?
vi: Đang xử lí gửi email reset mật khẩu... bạn có chắc chắn muốn thoát?

source: Send password reset email success
vi: Gửi email reset mật khẩu thành công

source: Edit profile
vi: Chỉnh sửa thông tin

source: User profile
vi: Thông tin tài khoản

source: Change password
vi: Thay đổi mật khẩu

source: Exit update password
vi: Thoát cập nhật mật khẩu

source: Processing update password...Are you sure you want to exit?
vi: Xử lý mật khẩu cập nhật ... Bạn có chắc chắn muốn thoát?

source: Change password successfully
vi: Thay đổi mật khẩu thành công

source: Unknown error
vi: Lỗi không rõ

source: Weak password
vi: Mật khẩu yếu

source: User disabled
vi: Người dùng bị vô hiệu hóa

source: User not found
vi: Không tìm thấy người dùng

source: Requires recent login
vi: Yêu cầu đăng nhập gần đây

source: Operation not allowed
vi: Hoạt động không cho phép

source: Change password not successfully, error: $messageText
vi: Thay đổi mật khẩu không thành công, lỗi: $messageText

source: Invalid password
vi: Mật khẩu không hợp lệ

source: Submit changes
vi: Gửi thay đổi

source: Exit update user info
vi: Thoát cập nhật thông tin người dùng

source: Processing update info...Are you sure you want to exit?
vi: Xử lý thông tin cập nhật ... Bạn có chắc chắn muốn thoát?

source: Invalid information
vi: Thông tin không hợp lệ

# uknown_error
source: Unknown error
vi: Lỗi không rõ

source: Update successfully
vi: Cập nhật thành công

source: Update user info
vi: Cập nhật thông tin người dùng

source: User information
vi: Thông tin người dùng

source: Phone
vi: Điện thoại

source: Status
vi: Trạng thái

source: Active
vi: Hoạt động

source: Inactive
vi: Không hoạt động

source: Joined date
vi: Ngày tham gia

source: Last updated
vi: Cập nhật

source: Posted rooms:
vi: Phòng đã đăng:

source: Created: $date
vi: Tạo: $date

# last_updated_date
source: Updated: $date
vi: Cập nhật: $date
